# Main
import math
import ast
import operator
import logging

import sympy # символьная математика (аналитическое решение уравнений, производные и интегралы в буквенном виде)
import scipy # решение дифференциальных уравнений, интегрирование, оптимизация и обработка сигналов поверх NumPy
import numpy # работа с многомерными массивами и быстрая линейная алгебра — фундамент любых физических расчетов

# Механика и симуляция движения
import pymunk # 2D-физический движок 

# Физика
import qiskit

# Testing
import pytest